app/services/user_serializer.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 1]]
---
    def extractFavorites
        @user.favorites.map do |favorite|