app/controllers/activities_controller.rb

    def create
        @user_id = params[:userID]
        @activity = Activity.find_by(key: params[:key])
        if !@activity
            @activity = Activity.create(
                name: params[:activity],
                accessibility: params[:accessibility],
                participants: params[:participants],
                price: params[:price],
                key: params[:key],
                activity_type: params[:type]
            )
---
SELECT "activities".* FROM "activities" WHERE "activities"."key" = $1 LIMIT $2  [["key", 8926492], ["LIMIT", 1]]
INSERT INTO "activities" ("name", "accessibility", "participants", "price", "key", "created_at", "updated_at", "activity_type") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def newFav user_id, activity_id
        @favorite = Favorite.where("user_id = ? AND activity_id = ?", @user_id, @activity_id)
        if @favorite.empty?
            @favorite = Favorite.create(
            user: User.find(@user_id),
            activity: Activity.find(@activity_id)
            )
---
SELECT 1 AS one FROM "favorites" WHERE (user_id = 1 AND activity_id = 19) LIMIT $1  [["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE (user_id = 1 AND activity_id = 5)
INSERT INTO "favorites" ("user_id", "activity_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["activity_id", 28], ["created_at", "2021-02-11 23:02:02.836839"], ["updated_at", "2021-02-11 23:02:02.836839"]]
SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]