app/controllers/favorites_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 6]]
---
    def destroy
        @favorite = Favorite.find(params[:id])
        @favorite.destroy

SELECT "favorites".* FROM "favorites" WHERE (user_id = 1 AND activity_id = 8)
SELECT 1 AS one FROM "favorites" WHERE (user_id = 1 AND activity_id = 1) LIMIT $1  [["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "activity_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["activity_id", 4], ["created_at", "2021-02-11 20:36:48.005716"], ["updated_at", "2021-02-11 20:36:48.005716"]]
SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def newFav
        @user_id = params[:user_id].to_i
        @activity_id = params[:activity_id].to_i
        @favorite = Favorite.where("user_id = ? AND activity_id = ?", @user_id, @activity_id)
        if @favorite.empty?
            @favorite = Favorite.create(
            user: User.find(@user_id),
            activity: Activity.find(@activity_id)
            )