app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-02-11 23:30:21.926470"], ["updated_at", "2021-02-11 23:30:21.926470"]]
---
    def create
        @newUser = User.create(
            name: params[:name]
        )

SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Kat"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Sam"], ["created_at", "2021-02-11 22:08:33.272911"], ["updated_at", "2021-02-11 22:08:33.272911"]]
---
    def login
        @user = User.find_by(name: params[:name])
        if !@user
            @user = User.create(
                name: params[:name]
            )